//----------------------------------------------------------------------------

//Модуль поддержки клавиатуры: header file

//----------------------------------------------------------------------------

#ifndef KEYBOARD_H
#define KEYBOARD_H

//----------------------------------------------------------------------------

#include "systimer.h"

//----------------------------- Константы: -----------------------------------

enum KeyMsg_t //коды сообщений клавиатуры
{
  KBD_NOP    = 0x00, //нет нажатия
  KBD_OUT    = 0x01, //кнопка OUT ON/OFF
  KBD_ENC    = 0x02, //кнопка энкодера
  KBD_HOLD   = 0x80, //флаг удержания кнопки
  KBD_ENCH   = KBD_ENC  + KBD_HOLD, //удержание кнопки энкодера
  KBD_ERROR  = 0x7F  //код ошибки для запрета операций
};

//----------------------------------------------------------------------------
//--------------------------- Класс TKeyboard: -------------------------------
//----------------------------------------------------------------------------

class TKeyboard
{
private:
  TGpio<PORTB, PIN11> Pin_KeyO; 
  TGpio<PORTB, PIN12> Pin_KeyE; 
  TSoftTimer *DebounceTimer;
  TSoftTimer *HoldTimer;
  KeyMsg_t Prev_Key;
public:
  TKeyboard(void);
  void Execute(void);
  KeyMsg_t Scan(void);
  KeyMsg_t Message;
};

//----------------------------------------------------------------------------

#endif
