//----------------------------------------------------------------------------

//Project:  PSL-2401
//Compiler: IAR EWARM 6.50
//Target:   STM32F100C8T6B

//----------------------------------------------------------------------------

#include "main.h"
#include "control.h"
#ifdef PSL2402
  #include "port.h"
#endif

//----------------------------- Переменные: ----------------------------------

TControl *Control;
#ifdef PSL2402
  TPort *Port;
#endif

//----------------------------------------------------------------------------
//------------------------- Основная программа: ------------------------------
//----------------------------------------------------------------------------

int main(void)
{
  TSysTimer::Init();        //инициализация системного таймера
  Control = new TControl(); //создание объекта управления
#ifdef PSL2402
  Port = new TPort();       //создание объекта порта
#endif
  
  do                        //основной цикл
  {
    TSysTimer::Sync();      //синхронизация системных тиков с основным циклом
    Control->Execute();     //выполнение местного управления
#ifdef PSL2402
    Port->Execute();        //выполнение команд компьютера
#endif
  }
  while(1);
}

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
